[
{
    "id": "31bc3b10-224f-4f19-a3c6-e1a0a5059ead",
    "url": "https://jobs.lever.co/economicmodeling/31bc3b10-224f-4f19-a3c6-e1a0a5059ead",
    "job_title": "Account Executive",
    "description": "Emsi is hiring a results-driven Account Executive who is passionate about customer success in the University market. We are looking for someone who will combine exceptional leadership and quantitative analysis skills, with the ability to work effectively in a highly dynamic environment. \n\nAs an Account Executive, you will be responsible for generating revenue via the phone and in-person visits with decision makers at Higher Education institutions.  This will involve focusing on driving new market share by prospecting, developing, maintaining and closing business with clients in a defined territory.\n\nYou should be highly-organized and detail-oriented, with the ability to manage multiple competing priorities. Furthermore, it is important that you display excellent verbal and written communication, interpersonal, and presentation skills.\n",
    "company": "EMSI",
    "createdAt": 1545072210645,
    "lists": [
        {
            "text": "Job Responsibilities",
            "content": "<li>Building relationships in our University sector</li><li>Discovering opportunities to serve potential clients via phone, travel, email and other creative approaches</li><li>Making use of creativity and analysis to craft and deliver highly relevant presentations</li><li>Learning and implementing the economic concepts, which relate to our services and the situation of our clients</li><li>Mentoring less experienced reps</li><li>Defining and implementing goals that are critical to the success of the organization</li>"
        },
        {
            "text": "Specific Qualifications",
            "content": "<li>Bachelor’s Degree,&nbsp;<i>preferred</i></li><li>Minimum of 3 years of work experience; proven sales experience,&nbsp;<i>preferred</i></li><li>Proven experience in conceptual sales, solution selling and value-based selling, <i>preferred</i></li><li>Proven experience with performance based compensation structure, <i>preferred</i></li><li>Proven experience with cold calling, <i>preferred</i></li><li>Proficiency working with MS Office Suite, particularly Word, Excel and PowerPoint</li><li>Willingness to travel</li>"
        }
    ],
    "location": "Moscow, ID",
    "team": "Sales",
    "department": "Higher Education",
    "commitment": "Full Time",
    "other_categories": {},
    "job_subtitle": "Universities"
},
{
    "id": "c97d9f0f-4809-4d2f-80a5-aea4d7c5a479",
    "url": "https://jobs.lever.co/economicmodeling/c97d9f0f-4809-4d2f-80a5-aea4d7c5a479",
    "job_title": "Account Manager",
    "description": "Provide top notch customer service experience and maximize customer success with our products. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder.\n",
    "company": "EMSI",
    "createdAt": 1525207465297,
    "lists": [
        {
            "text": "Core Responsibilities",
            "content": "<li>Maintain a strong working knowledge of HE customers at every level of their organization (<i>from decision makers to researchers</i>) and ensure they are equipped with the knowledge, data and tools needed to form and execute their vision.</li><li>Identify growth opportunities within the institution and communicate those opportunities with sales and consulting teams.</li><li>Negotiate, document and invoice renewals with clients.</li><li>Coordinate the implementation of new subscriptions.</li><li>Provide ongoing training and consultation to clients.</li><li>Make meaningful contact quarterly (<i>minimum</i>) with every client.</li><li>Plan strategic location trips to meet with clients at their organization (<i>e.g. travel to Phoenix and meet with all clients in the area</i>).</li><div>Establish client specific goals for every client with metrics for success.</div>"
        },
        {
            "text": "Knowledge, Skills and Abilities",
            "content": "<li>Ability to maintain a high level of activity, manage multiple competing priorities, and work effectively in a competitive, results-driven culture.</li><li>Ability to positively adapt to change in a highly dynamic work environment.</li><li>Experience working on a performance-based compensation structure highly desired.</li><li>Outstanding written and verbal communication, presentation, and time management skills.</li><li>Highly proficient in using the internet and all MS Office programs, particularly Word, Excel and PowerPoint.</li><li>Strong qualitative and quantitative analysis skills.</li>"
        },
        {
            "text": "Credentials and Experience ",
            "content": "<li>A Bachelor’s Degree is preferred.</li><li>Sales experience and experience working with higher education is strongly preferred.</li>"
        }
    ],
    "location": "Moscow, ID",
    "team": "Client Services",
    "department": "Higher Education",
    "commitment": "Full Time",
    "other_categories": {},
    "job_subtitle": "Higher Education"
},
{
    "id": "1999a4b5-0783-45d9-843a-e50d86263831",
    "url": "https://jobs.lever.co/economicmodeling/1999a4b5-0783-45d9-843a-e50d86263831",
    "job_title": "Business Development Representative",
    "description": "Position Overview\n\nWe are looking for talented Business Development Reps who will help us find and develop new client relationships.  The BDR will work with our sales team and develop leads for our Account Executives through outbound marketing and messaging to targeted accounts.  We value integrity, intelligence, good humor, and a professional who wants to learn, grow, and earn.  Successful performers will be first in line for promotion to a closing role.\n",
    "company": "EMSI",
    "createdAt": 1579646855560,
    "lists": [
        {
            "text": "Job Duties and Responsibilities",
            "content": "<li>Prospect into a defined account list via phone, email, social selling, and other creative approaches.</li><li>Represent our values while conducting business with the highest level of honesty and integrity.</li><li>Help potential customers see and define the scope of the issues in their businesses, and position our software solutions to enable these organizations to enact real change.</li><li>Use research, creativity, and analysis to craft and deliver relevant messaging at the opportune time.</li><li>Work independently without constant oversight</li><li>Have personality, be comfortable, enjoy our culture, be competitive</li>"
        },
        {
            "text": "Requirements",
            "content": "<li>Willing to learn and be coached – we will mentor, develop, and train you</li><li>You work hard to win, and hate to lose</li><li>Energetic, optimistic, and entrepreneurial </li><li>Desire to work in a mature, sophisticated, professional, and fun sales culture</li><li>Excellent communication skills, both verbal and written</li><li>Bachelor’s degree desired, but not necessary</li>"
        }
    ],
    "location": "Moscow, ID",
    "team": "Sales",
    "department": "Talent",
    "commitment": "Full Time Internship",
    "other_categories": {},
    "job_subtitle": ""
},
{
    "id": "7e877539-d5fb-43fb-933c-a960c958501c",
    "url": "https://jobs.lever.co/economicmodeling/7e877539-d5fb-43fb-933c-a960c958501c",
    "job_title": "Commercial Account Executive",
    "description": "Emsi is the leader in Enterprise big data analytics, delivering our software solutions to support mission-critical decisions for our clients.  Visit us at www.economicmodeling.com.\n \nWe are looking for talented Account Executives who will help us develop long-term client relationships within defined multi-state territories.  In this role you will develop and close new business through your own prospecting as well as through our partner/channel environment.  Our territories are massive, and the opportunity for growth and quota retirement are real.  We value hunger, intelligence, and a professional who conducts business with impeccable integrity.   \n",
    "company": "EMSI",
    "createdAt": 1578691174081,
    "lists": [
        {
            "text": "Job Duties and Responsibilities",
            "content": "<li>Prospect into enterprise accounts via phone, email, social selling, and other creative approaches.</li><li>Build positive professional relationships with clients while working in collaboration with internal team members in marketing, consulting, customer-service and product development, in order to provide impressive solutions leading to impressive results for our clients.</li><li>Help potential customers see and define the scope of the issues in their business and deliver software and consulting solutions that empower these organizations to enact real change.</li><li>Use research, creativity, and analysis to craft and deliver highly relevant presentations to clients via online meetings or by means of travel to on-site meetings and conferences.</li><li>Learn and use the economic and data concepts that relate to our services and the situations of our clients.</li><li>Generate sales through outbound prospecting, channel sales, and inbound leads</li><li>Effectively mentor and guide your assigned Business Development Rep to help generate leads</li><li>Some travel required</li>"
        },
        {
            "text": "Requirements",
            "content": "<li>1-3 years experience with consultative and solution-based software sales preferred</li><li>Demonstrated history of quota achievement in a competitive environment</li><li>Energetic, optimistic, and entrepreneurial </li><li>Desire to work in a mature, sophisticated, and professional sales culture</li><li>Excellent communication skills, both verbal and written</li><li>Ability to positively adapt to change in a highly dynamic work environment</li><li>Outstanding written and verbal communication, presentation, and time management skills</li><li>Bachelor’s degree highly desired</li>"
        }
    ],
    "location": "Moscow, ID",
    "team": "Sales",
    "department": "Talent",
    "commitment": "Full Time",
    "other_categories": {},
    "job_subtitle": ""
},
{
    "id": "912d55ec-0246-4095-8c81-bbc993a1fd8b",
    "url": "https://jobs.lever.co/economicmodeling/912d55ec-0246-4095-8c81-bbc993a1fd8b",
    "job_title": "Corporate Counsel",
    "description": "Emsi is a fast-growing labor market data and analytics company headquartered in Moscow, Idaho. We are looking to hire a full-time attorney to join our in-house legal team. \n\nIn this role, you will report to Emsi’s General Counsel, and will work directly with Emsi’s sales and client-services teams – as well as legal, procurement, and leadership within client and vendor organizations – to draft, review, and negotiate commercial contracts. You will also draft and review internal employment and policy documents, and assist Emsi’s General Counsel and Contract Manager in managing Emsi’s client, vendor, and internal legal documents. \n\nBecause Emsi is a fast-growing company (we are moving into a newly-built corporate headquarters in Moscow ID in December 2020), you will have abundant opportunities to expand your responsibilities as Corporate Counsel. Emsi’s General Counsel serves the day-to-day contract needs of Emsi’s sales and client services operations, but also serves the important role of trusted advisor in many aspects of Emsi’s business, including strategic planning and decision making, internal policymaking, and personnel management. So, as a member of Emsi’s legal team, you will have frequent opportunities to grow both your legal and corporate career experience as you contribute to Emsi’s success in all facets of the business. \n\nEmsi legal takes seriously the company’s foundational commitment to bless Emsi’s customers, employees, and shareholders. If you are interested in being an important part of that mission, please apply below. \n",
    "company": "EMSI",
    "createdAt": 1605641010195,
    "lists": [
        {
            "text": "Basic Qualifictions:",
            "content": "<li>Licensed to practice law in a U.S. jurisdiction and ability to obtain Idaho house counsel license (full Idaho license not required)&nbsp;</li><li>Excellent drafting skills (ability to draft clear and concise contract terms at volume)</li><li>Excellent written communication skills (especially the ability to quickly compose clear and concise emails)</li><li>Customer-service mindset (Emsi legal exists to help internal “customers” and external customers – legal should never present an unnecessary roadblock to anyone else doing their job)</li><li>Flexibility (your job will generally be as described above, but you will be expected to contribute how and where you can serve Emsi best – even if that doesn’t fit strictly within your job description)&nbsp;&nbsp;</li><li>Excellent attitude&nbsp;</li>"
        },
        {
            "text": "Preferred Qualification:",
            "content": "<li>Particular consideration will be given to applicants with expertise in labor and employment law</li>"
        },
        {
            "text": "Application Requirements:",
            "content": "<li>Resume</li><li>Cover letter</li><li>Three references (with contact info)</li>"
        },
        {
            "text": "Optional Application Materials (submit if available)",
            "content": "<li>Professional writing/drafting sample (e.g., briefs submitted, contracts drafted, etc.)</li>"
        }
    ],
    "location": "Moscow, ID",
    "team": "Legal",
    "department": "Corporate",
    "commitment": "Full Time",
    "other_categories": {},
    "job_subtitle": ""
},
{
    "id": "b18b606e-bc98-443b-ab72-852cedd71776",
    "url": "https://jobs.lever.co/economicmodeling/b18b606e-bc98-443b-ab72-852cedd71776",
    "job_title": "Data Engineer",
    "description": "We are looking for a highly motivated data engineer who will find optimal ways to process and enrich messy user-submitted data which will help us better answer questions about the workforce, educational programs, and job opportunities. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder. \n",
    "company": "EMSI",
    "createdAt": 1611787871868,
    "lists": [
        {
            "text": "Core Responsibilities",
            "content": "<li>Be familiar with our data clients, both in-house and external, and determine how best to get our data into their tools.</li><li>Build and maintain data processing pipelines for several major data sources for job postings and professional profiles.</li><li>Create and preserve knowledge with well-written documentation.</li><li>Maintain Elasticsearch clusters and the servers they run on.</li>"
        },
        {
            "text": "Organizational Relationships",
            "content": "<li>This position reports to the Senior Director of Data Innovation.</li>"
        },
        {
            "text": "Knowledge, Skills, and Abilities",
            "content": "<li>Strong software engineering, programming, and QA skills</li><li>Proficiency with Linux (or other POSIX).</li><li>Proficiency with a systems programming language.</li><li>Experience with lean/agile development, kanban, and test-driven development practices, preferred.</li><li>Gitlab, AWS ecosystem, preferred.</li><li>Experience with D and/or Scala languages, preferred.</li><li>Experience with batch processing (AWS Batch) and/or Apache Spark (AWS EMR), preferred.</li>"
        },
        {
            "text": "Traits",
            "content": "<li>Attention to detail</li><li>Self-starter</li><li>Curious</li><li>Customer Oriented</li><li>Organized</li><li>Problem solving</li><div><br></div>"
        },
        {
            "text": "Credentials and Experience",
            "content": "<li>2+ years Python experience, preferred</li><li>2+ years experience in a professional setting, preferred</li><li>Bachelor’s degree, preferred</li>"
        },
        {
            "text": "Physical Requirements / Work Environment",
            "content": "<li>Those necessary for general office work</li><li>Office environment for majority of the time</li>"
        }
    ],
    "location": "Moscow, ID",
    "team": "Data and Analytics",
    "department": "Corporate",
    "commitment": "Full Time",
    "other_categories": {},
    "job_subtitle": ""
},
{
    "id": "2236a017-a4ba-45ae-b75c-2ced903572fb",
    "url": "https://jobs.lever.co/economicmodeling/2236a017-a4ba-45ae-b75c-2ced903572fb",
    "job_title": "Data Engineer",
    "description": "Emsi is looking for a Data Engineer to work on the Web Scraping team. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder\n",
    "company": "EMSI",
    "createdAt": 1611787533409,
    "lists": [
        {
            "text": "Core Responsibilities",
            "content": "<li>Create and improve processes, tools, workflows, and resilient data architecture to scrape web content.&nbsp;&nbsp;</li><li>Manage data accuracy and quality.&nbsp;</li><li>Identify and rectify any issues with breaks as well as scale scrapers as needed.</li>"
        },
        {
            "text": "Organizational Relationships",
            "content": "<li>This position reports to the Senior Director of Data Innovation.</li>"
        },
        {
            "text": "Knowledge, Skills, and Abilities",
            "content": "<li>Web scraping experience (Scrapy or similar technologies)</li><li>Solid understanding of web technologies (HTML, JavaScript, CSS, XPath, JSON, etc)</li><li>Experience with ETL and creating data pipelines</li><li>Basic Linux and Git experience</li><li>Python</li><li>Scrapy Python library</li><li>AWS/AWS Batch</li><li>Familiarity with data processing tools (pandas, regex, SQL)</li>"
        },
        {
            "text": "Traits",
            "content": "<li>Attention to detail</li><li>Self-starter</li><li>Curious</li><li>Customer Oriented</li><li>Organized</li><li>Problem solving</li><div><br></div>"
        },
        {
            "text": "Credentials and Experience",
            "content": "<li>2+ years Python experience, preferred</li><li>Professional experience with web scraping preferred</li><li>Bachelor’s degree, preferred</li>"
        },
        {
            "text": "Physical Requirements / Work Environment",
            "content": "<li>Those necessary for general office work</li><li>Office environment for majority of the time</li>"
        }
    ],
    "location": "Moscow, ID",
    "team": "Data and Analytics",
    "department": "Corporate",
    "commitment": "Full Time",
    "other_categories": {},
    "job_subtitle": "Web Scraping"
},
{
    "id": "912f06cf-a3af-41d2-8ee6-32655fe3ccd2",
    "url": "https://jobs.lever.co/economicmodeling/912f06cf-a3af-41d2-8ee6-32655fe3ccd2",
    "job_title": "Economic Analyst",
    "description": "The Economic Analyst at Emsi works with the Higher Education (HE) Consulting team to produce innovative datasets, data models, visualizations, and reports that answer our clients’ most pressing problems. A successful candidate will bring a passion for finding creative ways to apply data to solve client problems by developing and bringing to market actionable insights. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder.\n",
    "company": "EMSI",
    "createdAt": 1584476960908,
    "lists": [
        {
            "text": "Core Responsibilities",
            "content": "<li>Conduct quantitative analysis using Emsi data and other data sources to research, model, and report solutions for colleges and universities.</li><li>Collaborate with the Director of Higher Education Consulting and team members to scope, build, and deliver standard and custom reports.</li><li>Document methodology and findings of the quantitative analyses, with the added ability of simplifying and interpreting the findings to a variety of audiences.</li><li>Communicate with clients the findings of the analyses, including how to use the findings to make data-driven decisions.</li>"
        },
        {
            "text": "Knowledge, Skills & Abilities",
            "content": "<li>Strong written and verbal communication skills.</li><li>Strong analytical skills.</li><li>Strong quality assurance skills with attention to detail in both quantitative analyses and technical writing.</li><li>Proficiency with Microsoft Office Suite and Google Suite with advanced skills in Excel.</li><li>Ability to work effectively both independently and in a team environment.</li><li>Creative problem-solving skills and the ability to look at the numbers, trends, and data to derive conclusions based on findings.</li><li>Ability to compose written analyses that explain complex economic concepts in simple terms.</li>"
        },
        {
            "text": "Credentials and Experience",
            "content": "<li>Bachelor’s degree or master’s degree in Economics or a field with a quantitative and analytic focus, or at least 3-years of experience in performing statistical or economic analysis.</li><li>Experience making data-driven decisions, preferably for higher education institutions.</li>"
        }
    ],
    "location": "Moscow, ID",
    "team": "Professional Services",
    "department": "Higher Education",
    "commitment": "Full Time",
    "other_categories": {},
    "job_subtitle": "Higher Education"
},
{
    "id": "53b36bf2-ebe0-412b-aec2-bc0c4ab2345d",
    "url": "https://jobs.lever.co/economicmodeling/53b36bf2-ebe0-412b-aec2-bc0c4ab2345d",
    "job_title": "Financial Analyst",
    "description": "The Financial Analyst is part of the Emsi finance team and plays a crucial role in our execution of growth initiatives and constant innovation around optimizing and evaluating existing revenue and expenditure. Success in the role will require a mastery of our culture, history and operating principles to help ensure\nrobust and thorough analysis and prevent flawed analytical results even if “technically correct.” Forms of data involved in this role are not limited to financial but will also include a wide array of operational and HR data with qualitative information and insights. The operating principle for all analysis will be production\nof meaningful and true analysis, never reducing to the production of numbers to support decisions stakeholders have already made. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the\nshareholder.\n",
    "company": "EMSI",
    "createdAt": 1611702283262,
    "lists": [
        {
            "text": "Core Responsibilities",
            "content": "<li>Maintain a working knowledge of Emsi’s various products and services.&nbsp;</li><li>Produce monthly slide decks for Emsi and BUs (typically within 3 working days of month end).&nbsp;</li><li>Schedule BU meetings to occur within 7 working days of month end.&nbsp;</li><li>Attend BU meetings with (a) ability to comment on any apparent data anomalies or reasonable questions and (b) mechanism to record any agreed changes / developments and implement immediately so that the same request is not needed twice.&nbsp;</li><li>Coordinate development and production of any special slide decks whether part of the monthly BU meetings or separately (e.g. BU renewals, sales, product trajectories, cost areas, etc.).</li><li>Organize data and records, and capably record the results of decisions and discussions so that leadership can rely on your work while assessing success of growth investments.</li><li>Produce scopes for any analytics requests, to be agreed to with your manager before performing an analytics request. This process is to be used for all requests even from those higher up the org chart than your manager (e.g. CEO, parent company, investors).&nbsp;</li><li>Quarterly review of product catalogue in SalesForce with product and business leaders to ensure obsolete products are removed and new products are included, with any additions or removals being approved by COO and CEO.</li><li>Perform required seasonal reporting to assist in launch of new markets, products or similar, which may include weekly cadence of reporting; looking to transition such projects into the typical workflow when increased cadence no longer provides significant value.&nbsp;</li><li>Play a special role in the annual budget process and periodic forecast updates throughout the year, coordinating such efforts with colleagues on the financial accounting team.</li><li>Complete special projects as assigned (e.g. tracking costs related to a grant, or potential insurance and/or legal claim.)</li><li>Pursue professional development so that your current abilities and experiences do not define the upper limit on what you can contribute to Emsi. This could include advocating for formal professional development but will also include spending time learning from those you are connected with professionally, such as at Emsi’s parent company.&nbsp;</li><li>Collaborate with IT and others in finance to assist in evaluating and implementing analytical tools and systems with foresight to articulate deficiencies that hold you back from success.&nbsp;</li>"
        },
        {
            "text": "Organizational Relationships",
            "content": "<li>The Financial Analyst reports directly to the Controller and also works closely with COO/CFO and other stakeholders including BU Leaders, Product, Marketing, Sales and Customer Service Leaders, Sr. Financial Analyst at Parent Company and/or other designated representatives at Parent Company or other investors and Emsi board members.</li>"
        },
        {
            "text": "Knowledge, Skills, and Abilities",
            "content": "<li>Strong written and verbal communication skills with the ability to communicate “up” the organizational chart avoiding any surprises.&nbsp;</li><li>Advanced knowledge of Excel and proficiency with Microsoft Office Suite.&nbsp;</li><li>Critical-thinking skills.</li><li>Strong organizational skills.&nbsp;</li><li>Ability to handle ambiguous project and maintain feedback through each step to completion.</li><li>Ability to coordinate with broad stakeholder groups.&nbsp;</li><li>Ability to judge and balance confident execution of projects with manager input and review, while maintaining awareness to take direct and indirect feedback around the balancing of these competing priorities.</li><li>Ability to review your own work for anomalies that indicate flaws in analysis and have the energy and intuition to enquire with relevant parties regarding anything that needs validating or testing.</li>"
        },
        {
            "text": "Traits",
            "content": "<li>Curious&nbsp;</li><li>Focused&nbsp;</li><li>Service-oriented</li><li>Analytical</li><li>Accountable</li><li>Approachable</li><li>Honest</li><li>Forthright&nbsp;Flexible</li>"
        },
        {
            "text": "Credentials and Experience ",
            "content": "<li>Bachelor’s Degree in accounting, finance, statistics, economics business administration or a related field.&nbsp;</li><li>SaaS experience preferred. </li>"
        },
        {
            "text": "Physical Requirment/Work Environment",
            "content": "<li>Those necessary for general office work.&nbsp;</li><li>Typical office environment majority of the time.&nbsp;</li>"
        }
    ],
    "location": "Moscow, ID",
    "team": "Finance",
    "department": "Corporate",
    "commitment": "Full Time",
    "other_categories": {},
    "job_subtitle": ""
},
{
    "id": "3e4d2eca-5bc7-4309-b27d-373938c1ce59",
    "url": "https://jobs.lever.co/economicmodeling/3e4d2eca-5bc7-4309-b27d-373938c1ce59",
    "job_title": "Full Stack Web Developer",
    "description": "Emsi is a trusted advisor on labor market information for customers across a wide array of markets. We build SaaS products that combine many different kinds of workforce data to accurately inform our clients’ decisions about college course offerings, hiring, site selection, economic development, and much more. We need an experienced developer to join us in producing premier software tools for understanding labor market data. \n\nIf you’re ready to join a high-functioning team of full stack devs working closely with product managers, data engineers, and designers to create interfaces and visualizations that make nuanced data intelligible, we’d love to hear from you. Applicants to this posting will be considered for positions on the Analyst, CareerCoach, and SkillsMatch development teams. \n",
    "company": "EMSI",
    "createdAt": 1610666742341,
    "lists": [
        {
            "text": "People who succeed in this position are:",
            "content": "<li>Team oriented and ready to work closely with other developers</li><li>Comfortable with working in rapid development cycles</li><li>Skilled oral and written communicators</li><li>&nbsp;Enthusiastic for learning</li><li>Prepared to contribute at a strategic level to engineering excellence discussions from day one</li>"
        },
        {
            "text": "Candidates must have: ",
            "content": "<li>Two years of experience with React development in a production environment</li><li>Two years or more experience with server-side languages like PHP, Python, or Node</li><li>One or more years of experience managing production environments in AWS</li><li>Working knowledge of structured databases, e.g. MySQL, PostgreSQL</li>"
        },
        {
            "text": "Great candidates also have:",
            "content": "<li>Experience with microservice architecture</li><li>Experience building and consuming APIs</li>"
        }
    ],
    "location": "Moscow, ID",
    "team": "Engineering",
    "department": "Corporate",
    "commitment": "Full Time",
    "other_categories": {},
    "job_subtitle": ""
},
{
    "id": "681f7555-a1eb-4f1b-b7b3-d979c21e9a22",
    "url": "https://jobs.lever.co/economicmodeling/681f7555-a1eb-4f1b-b7b3-d979c21e9a22",
    "job_title": "Graphic Design Intern",
    "description": "In this role you would work with the Marketing team to produce data visualizations, infographics, and page layouts. This role will primarily involve the design and layout of Economic Impact Studies for the higher ed consulting team but can transition into additional design and layout opportunities. A successful candidate will bring a desire to learn, a strict attention to detail, ability to meet deadlines, a basic understanding of translating numbers into graphs and charts, and an eye for page design and typography. \n",
    "company": "EMSI",
    "createdAt": 1612235729323,
    "lists": [
        {
            "text": "Core Responsibilities",
            "content": "<li>Produce and design both long and short documents using existing templates in Adobe InDesign</li><li>Create graphs and charts, primarily using the Chartwell font</li><li>Edit photos, create simple data visualizations, and design additional web graphics or page layouts as needed</li><div><br></div>"
        },
        {
            "text": "Organizational Relationships",
            "content": "<li>This position reports to our Chief Innovation Officer and works closely with the Higher Education consulting team.</li>"
        },
        {
            "text": "Knowledge, Skills, and Abilities",
            "content": "<li>Basic familiarity with Adobe InDesign, Acrobat, and other Adobe CC software</li><li>Close attention to detail</li><li>Ability meet strict deadlines</li><li>An artistic eye for the fundamentals of design: color, balance, hierarchy, etc.</li><li>Basic grammar and copy editing abilities</li><li>Knowledge of Microsoft Office Suite and Google Suite with advanced skills in Excel</li><li>Ability to work effectively both independently and in a team environment.</li><li>Creative visual problem-solving skills and the ability to translate text and data into compelling graphics</li>"
        },
        {
            "text": "Traits",
            "content": "<li>Detail oriented</li><li>Creative</li><li>Customer oriented</li><li>Collaborative</li>"
        },
        {
            "text": "Credentials and Experience",
            "content": "<li>Completed high school or equivalent</li><li>Some experience with design work. (Portfolio of past projects recommended)</li><li>Some experience using Adobe CC applications (InDesign required)</li><li>Basic knowledge of Microsoft Word and Excel</li>"
        },
        {
            "text": "Physical Requirements / Work Environment",
            "content": "<li>Those necessary for general office work</li><li>Office environment for majority of the time</li>"
        }
    ],
    "location": "Moscow, ID",
    "team": "Marketing",
    "department": "Corporate",
    "commitment": "Full Time Internship",
    "other_categories": {},
    "job_subtitle": ""
},
{
    "id": "526ae978-4794-49b5-b46a-1196ad606e93",
    "url": "https://jobs.lever.co/economicmodeling/526ae978-4794-49b5-b46a-1196ad606e93",
    "job_title": "Graphic Designer",
    "description": "In this role you would work with the Marketing team to produce corporate design pieces such as blog graphics, product brochures, PowerPoint presentations, data visualizations, etc. Due to the wide variety of project types, this role requires a broad knowledge of design principles and tools, as well as an eagerness to learn and develop new skills.  \n\n\n",
    "company": "EMSI",
    "createdAt": 1612236055536,
    "lists": [
        {
            "text": "Core Responsibilities",
            "content": "<li>Assist Corporate Marketing team members with graphics needs</li><li>Meet weekly with Design team to collaborate and strategize</li><li>Create effective graphics that follow Emsi’s brand guidelines</li>"
        },
        {
            "text": "Organizational Relationships",
            "content": "<li>This position reports to our Chief Innovation Officer.</li>"
        },
        {
            "text": "Knowledge, Skills, and Abilities",
            "content": "<li>Experience with Adobe Illustrator, Photoshop, inDesign, and other Adobe CC software</li><li>An artistic eye for the fundamentals of design: color, balance, hierarchy, etc.</li><li>Basic knowledge of UX principles and tools (Figma, Sketch)</li><li>Ability to meet strict deadlines</li><li>Ability to work effectively both independently and in a team environment.</li><li>Basic grammar and copy editing abilities</li><li>Close attention to detail</li><li>Basic knowledge of Microsoft Office Suite and Google Suite</li>"
        },
        {
            "text": "Traits",
            "content": "<li>Detail oriented</li><li>Creative</li><li>Customer oriented</li><li>Collaborative</li>"
        },
        {
            "text": "Credentials and Experience",
            "content": "<li>2+ years design experience (Portfolio of past projects recommended)</li><li>Design training/courses completed or in-progress</li>"
        },
        {
            "text": "Physical Requirements / Work Environment",
            "content": "<li>Those necessary for general office work</li><li>Office environment for majority of the time</li>"
        }
    ],
    "location": "Moscow, ID",
    "team": "Marketing",
    "department": "Corporate",
    "commitment": "Full Time",
    "other_categories": {},
    "job_subtitle": ""
},
{
    "id": "ad5f4959-9276-4fba-8ddf-390446c6b95c",
    "url": "https://jobs.lever.co/economicmodeling/ad5f4959-9276-4fba-8ddf-390446c6b95c",
    "job_title": "Join Our Talent Network!",
    "description": "Didn't find a job posting, but want to keep in touch? Submit your resume here, and we will reach out with any job openings that we think could be a good fit.\n\nIf you have any questions about Emsi, feel free to reach out to Aine Haynes, Talent Acquisition Specialist, at aine.haynes@economicmodeling.com\n",
    "company": "EMSI",
    "createdAt": 1533930402028,
    "lists": [],
    "location": "Moscow, ID",
    "team": "Talent Network",
    "other_categories": {},
    "job_subtitle": ""
},
{
    "id": "3b6c3fe9-ba9c-4193-9990-7b9f3d12f9ab",
    "url": "https://jobs.lever.co/economicmodeling/3b6c3fe9-ba9c-4193-9990-7b9f3d12f9ab",
    "job_title": "Lead Software Engineer",
    "description": "Emsi is a trusted advisor on labor market information for customers across a wide array of markets. We build SaaS products that combine many different kinds of workforce data to accurately inform our clients’ decisions about college course offerings, hiring, site selection, economic development, and much more. We need a senior front end developer to lead a small team that will build new data-heavy web applications.\n",
    "company": "EMSI",
    "createdAt": 1610667138111,
    "lists": [
        {
            "text": "People who succeed in this position are:",
            "content": "<li>Team oriented and ready to work closely with other developers</li><li>Comfortable with working in rapid development cycles, including prototyping</li><li>Skilled communicators</li><li>Ready to lead by example</li>"
        },
        {
            "text": "Requirements:",
            "content": "<li>5 years of experience in front end development</li><li>Built production applications with ES6 and <a href=\"http://React.js\" class=\"postings-link\">React.js</a></li><li>Experience with Node/Express backends</li><li>Hosted applications in AWS</li><li>Mentored junior developers</li>"
        },
        {
            "text": "Great candidates also have:",
            "content": "<li>Built data visualization web products</li><li>Collaborated with designers and product owners</li>"
        }
    ],
    "location": "Moscow, ID",
    "team": "Engineering",
    "department": "Corporate",
    "commitment": "Full Time",
    "other_categories": {},
    "job_subtitle": ""
},
{
    "id": "e5382e42-7d63-49dc-9ad1-ac8c215b6453",
    "url": "https://jobs.lever.co/economicmodeling/e5382e42-7d63-49dc-9ad1-ac8c215b6453",
    "job_title": "Marketing Specialist",
    "description": "Emsi is searching for a full time (40 hr/week) Marketing Specialist to join our Talent team. This role is an opportunity to gain hands-on experience working with a CRM, managing email marketing, and executing written content.\n\nTypical projects could include: executing and optimizing marketing emails, organizing webinars, writing press releases to announce Emsi’s new business partnerships, tracking campaigns and more.\n\nWe are looking for someone who is a self starter and can execute with minimal oversight, has strong organizational skills and is a quick and independent learner. This person should also have strong critical thinking and problem solving skills.\n",
    "company": "EMSI",
    "createdAt": 1611959231763,
    "lists": [
        {
            "text": "Preferred Skills",
            "content": "<li>Strong writing/verbal communication skills</li><li>Strong organization and collaboration skills</li><li>Motivated self starter</li><li>Ability to simplify complex concepts and communicate them in written format</li><li>Experience in email marketing, <i>preferred</i></li>"
        }
    ],
    "location": "Moscow, ID",
    "team": "Marketing",
    "department": "Talent",
    "commitment": "Full Time",
    "other_categories": {},
    "job_subtitle": ""
},
{
    "id": "349ca93d-fcb7-494f-88a8-8f75712c8e86",
    "url": "https://jobs.lever.co/economicmodeling/349ca93d-fcb7-494f-88a8-8f75712c8e86",
    "job_title": "Product Manager",
    "description": "Emsi is a leader in global labor analytics, helping a wide variety of clientele from higher education institutions to city/state governments as well as Fortune 1000 companies. We’ve built our company on the integrity of our data and the drive to be insatiably curious when it comes to solving our client’s talent issues. We’re looking for someone who is passionate about blessing customers to fill this Product role.\n\nThis role specifically will be focused on leading Emsi’s effort to expand our global footprint in regards to job postings data. This will range from monitoring sources, establishing quality processes, identify key customer requests, work on expanding insights to be extracted from the data and engage with customers on best use cases. You will be working with the Global Product Owner and Data Engineering teams to build solutions.\n",
    "company": "EMSI",
    "createdAt": 1612371069155,
    "lists": [
        {
            "text": "People who succeed in this position are...",
            "content": "<li>Intensely curious, adept at problem solving and ok with ambiguity</li><li>Incredibly detail oriented with a love for documentation</li><li>Able to take charge of a task assigned to them with a good deal of autonomy</li><li>Comfortable with working in rapid development cycles; we move fast</li>"
        },
        {
            "text": "In terms of technical ability, candidates must have…",
            "content": "<li>Strong written and verbal communication skills</li><li>Proficiency in a scripting language (Python preferred)</li><li>Good handle on SQL</li><li>Experience in research</li>"
        },
        {
            "text": "Great candidates also have…",
            "content": "<li>Ability to thrive in the world between clarity and chaos</li><li>ElasticSearch/Kibana helpful</li><li>Some foreign languages under their belt</li><li>A couple of years of experience in a related role</li>"
        }
    ],
    "location": "Moscow, ID",
    "team": "Product",
    "department": "Talent",
    "commitment": "Full Time",
    "other_categories": {},
    "job_subtitle": "Global Job Postings"
},
{
    "id": "c954a7bb-6312-4a9f-8168-b571458245ea",
    "url": "https://jobs.lever.co/economicmodeling/c954a7bb-6312-4a9f-8168-b571458245ea",
    "job_title": "Product Marketer - Emsi Skills",
    "description": "Emsi Skills is a free website / resource that houses Emsi’s library of 30,000 skills plus an array of prototypes. The site helps people access our library and serves as a powerful entry point for much of the work we do around skills.\n\nThis position will work with the director of the project to (1) grow and improve the site, (2) promote the site to large audiences, (3) serve the community that uses the site (internal Emsi employees and external Emsi clients), (4) coordinate across many different groups to execute and deliver projects, and (5) create content (case studies, blog posts, etc) to help promote the site. In carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder. \n",
    "company": "EMSI",
    "createdAt": 1613166462808,
    "lists": [
        {
            "text": "Core Responsibilities",
            "content": "<li>Work with the director of Emsi Skills to help support the many projects and partnerships that we have there</li><li>Work with the digital marketing team to create content, improve the site, and execute on projects that will help the site gain wider audiences</li><li>Create monthly reports on the site performance</li><li>Work with the communications team on blog posts, stories, and other collateral that will help promote the site</li><li>Support Emsi’s partnership teams as they have needs for content and materials</li><li>Work with the product and engineering teams to create enhancements for the site<b>&nbsp;</b></li>"
        },
        {
            "text": "Organizational Relationships",
            "content": "<li>Reporting to Emsi’s Chief Innovation Officer&nbsp;</li><li>Working closely with Emsi’s communications team and the director of Emsi Skills</li><li>Working closely with Emsi’s digital marketing team</li><li>Working closely with Emsi’s engineering and APIs team</li>"
        },
        {
            "text": "Knowledge, Skills, and Abilities",
            "content": "<li>Familiarity with Emsi’s data, especially the skills aspect</li><li>Strong project management background</li><li>Experience with managing websites and techniques used to improve visibility (like SEO)</li><li>Experience with content creation, especially writing and presenting</li><li>Some familiarity with Google Analytics, business reporting, and similar metric</li><li>Interest and familiarity with marketing practices and principles</li>"
        },
        {
            "text": "Traits",
            "content": "<li>Organized and able to handle multiple projects and responsibilities</li><li>Focused and diligent</li><li>Oriented on execution and delivery</li><li>Problem solver&nbsp;</li><li>Good at communicating (writing, presenting)Collaborative </li>"
        },
        {
            "text": "Credentials and Experience",
            "content": "<li>Experience with data and website management</li><li>Content creation</li>"
        },
        {
            "text": "Physical Requirements / Work Environment",
            "content": "<li>Those necessary for general office work</li><li>Office environment for majority of the time</li><li>Work closely with a wide range of people (data scientists, writers/editors, marketers, executives) </li>"
        }
    ],
    "location": "Moscow, ID",
    "team": "Marketing",
    "department": "Corporate",
    "commitment": "Full Time",
    "other_categories": {},
    "job_subtitle": ""
},
{
    "id": "d7aa3f0f-261a-44b0-ac8f-346fff74aca6",
    "url": "https://jobs.lever.co/economicmodeling/d7aa3f0f-261a-44b0-ac8f-346fff74aca6",
    "job_title": "Product Specialist",
    "description": "Provide technical expertise and support to customer needs, internal processes, and product teams.\nIn carrying out the objective of this position, a successful candidate will be committed to our values by working to bless the customer, bless the employee, and bless the shareholder. \n \nThis position reports to the Product Manager of Career Coach.\n",
    "company": "EMSI",
    "createdAt": 1611013534272,
    "lists": [
        {
            "text": "Core Responsibilities ",
            "content": "<li>Manage new client implementations for all software applications</li><li>Act as a knowledgeable resource on products</li><li>Build and maintain Career Coach sites</li><li>Create reports and resources for all software applications</li><li>Gather usage data and generate custom reports using Excel</li>"
        },
        {
            "text": "Knowledge, Skills, and Abilites",
            "content": "<li>Strong oral and written communication skills</li><li>Prioritization</li><li>Excellent time management</li><li>Strong organizational skills</li>"
        },
        {
            "text": "Traits",
            "content": "<li>Detail oriented</li><li>Customer oriented</li><li>Team oriented</li><li>Self-starter</li><li>Technical aptitude</li>"
        },
        {
            "text": "Credentials and Experience",
            "content": "<li>Advanced experience with Excel (advanced functions, graphing, pivot tables, Vlookup formulas)</li><li>B.A. or B.S. degree preferred</li><li>Experience working in an office setting preferred</li>"
        },
        {
            "text": "Physical Requirements / Work Environment",
            "content": "<li>Those necessary for general office work</li><li>Office environment for majority of the time</li>"
        }
    ],
    "location": "Moscow, ID",
    "team": "Product",
    "department": "Higher Education",
    "commitment": "Full Time",
    "other_categories": {},
    "job_subtitle": ""
},
{
    "id": "d4bf3a63-0a62-4b5d-b2d1-15b20ed74180",
    "url": "https://jobs.lever.co/economicmodeling/d4bf3a63-0a62-4b5d-b2d1-15b20ed74180",
    "job_title": "Software Engineer",
    "description": "Emsi is looking for a skilled software engineer to work on the Classifiers & Extractors team.  This team builds and maintains high-performance text extraction and classification libraries used to analyze job postings, resumes, and similar documents.  In addition to the machine learning solutions, this team also produces the internal tooling and data pipelines to support teams of taxonomists and curators working to continuously improve Emsi’s classifications and libraries.\n\nThe ideal candidate has significant experience working in high-performance systems languages, a working knowledge of linear algebra, and at least basic familiarity with machine learning techniques\n",
    "company": "EMSI",
    "createdAt": 1606944843231,
    "lists": [
        {
            "text": "Daily Responsibilities: ",
            "content": "<li>Develop and maintain extractors, classifiers, and the data pipelines to support them.</li><li>Research the most effective solutions to text extraction and classification problems.</li><li>Optimize solutions for maximal document per second per core throughput.</li><li>Work with Emsi’s taxonomists and data curators to build the internal tooling and data pipelines necessary to continuously improve our libraries.</li>"
        },
        {
            "text": "Key Skills:",
            "content": "<li>Systems programming on Linux, including working knowledge of virtual memory, optimizing for cacheline performance, and using the perf toolkit.</li><li>Proficient in the D programming language or similar (C, C++).</li><li>At least basic knowledge of machine learning techniques.</li><li>Working knowledge of linear algebra, experience with Intel MKL or similar desirable.</li><li>Good knowledge of algorithms and data structures.</li><li>Fluent English, written and spoken.</li><li>Git version control.</li><li>Debugging with GDB.</li><li>AWS S3, EC2, Athena.</li>"
        }
    ],
    "location": "Moscow, ID",
    "team": "Data and Analytics",
    "department": "Corporate",
    "commitment": "Full Time",
    "other_categories": {},
    "job_subtitle": ""
},
{
    "id": "e290ee6d-59f1-4736-93cb-d638e63e97e6",
    "url": "https://jobs.lever.co/economicmodeling/e290ee6d-59f1-4736-93cb-d638e63e97e6",
    "job_title": "Sr. Talent Acquisition Specialist",
    "description": "Location: Moscow, ID\n\nEmsi is growing rapidly, and we are looking for a Sr. Talent Acquisition Specialist to own the hiring process specifically for our sales roles and leadership roles, to proactively bring in talent and build talent pipelines. We are looking for someone who thrives on building relationships and networking with top talent, and who is innovative in their approach. \n\nAt Emsi we are committed to our core values of blessing the customer, employee, and shareholders. Our company was founded with the purpose of doing business with high integrity, providing an excellent work environment for people in our community. Hiring excellent candidates is key to continuing that mission. \n",
    "company": "EMSI",
    "createdAt": 1612371896612,
    "lists": [
        {
            "text": "Qualifications:",
            "content": "<li>Thorough understanding of Emsi’s core values and culture</li><li>Strong networking capabilities</li><li>Ability to build strong relationships with managers and employees</li><li>Understanding of best practices in the hiring process</li><li>Strong communication skills</li><li>Experience in recruiting or marketing, <i>preferred</i></li>"
        },
        {
            "text": " Responsibilities:",
            "content": "<li>Write strong job postings, utilizing best practices and where possible Emsi’s own technologies, and keep them fresh</li><li>Conduct initial interviews</li><li>For postings you specifically own, ensure frequent communication with the candidate, and schedule interviews for that process</li><li>Develop and implement strategies to increase our ability to hire difficult positions</li><li>Work with our Talent Acquisition specialist to build and manage our internship program</li><li>Work with marketing to build out candidate focused marketing campaigns, and implement and maintain a candidate-focused careers page</li><li>Build relationships with schools that produce promising candidates</li><li>Assist in development of systematic reporting for HR metrics</li>"
        }
    ],
    "location": "Moscow, ID",
    "team": "Human Resources",
    "department": "Corporate",
    "commitment": "Full Time",
    "other_categories": {},
    "job_subtitle": ""
}
]